app/Controllers/Home.php

SELECT *
FROM `tb_komoditas`
---
    public function index()
    {
        $data['komoditas'] = $this->komoditasModel->findAll();

SELECT *
FROM `tb_komoditas`
---
            return $item['productivitas'];
        }, $dataProduktivitas);

        $data = array(
            "komoditas" => $this->komoditasModel->findAll(),
            'namaKecamatanTanam' => $namaKecamatanTanam,
            'namaKecamatanPanen' => $namaKecamatanPanen,
            'produksi' => $produksi,
            'productivitas' => $productivitas,
        );