app/Controllers/KetuaKelompokTaniController.php

    public function index()
    {
        $data['petani'] = $this->ketuaKelompokTaniModel->select('tb_ketua_kelompok_tani.*')->join('users', 'users.id = tb_ketua_kelompok_tani.id_user')->where('users.active', '1')->findAll();
---
SELECT `tb_ketua_kelompok_tani`.*
FROM `tb_ketua_kelompok_tani`
JOIN `users` ON `users`.`id` = `tb_ketua_kelompok_tani`.`id_user`
WHERE `users`.`active` = '1'