app/Controllers/KoordinatController.php

    public function getKoordinatLahanAjax()
    {
        $idLahan = $this->request->getPost('id_lahan');
        $data = $this->koordinatModel->where('id_lahan', $idLahan)->findAll();
---
SELECT *
FROM `tb_koordinat`
WHERE `id_lahan` = '6'