app/Controllers/PetaniController.php

    public function index()
    {
        $data['petani'] = $this->petaniModel->select('tb_petani.*')->join('users', 'users.id = tb_petani.id_user')->where('users.active', '1')->findAll();
---
SELECT `tb_petani`.*
FROM `tb_petani`
JOIN `users` ON `users`.`id` = `tb_petani`.`id_user`
WHERE `users`.`active` = '1'

    public function edit($id)
    {
        $data['title'] = 'Edit Petani';
        $data['petani'] = $this->petaniModel->find($id);
        $data["kemlompok_tani"] = $this->kelompokTaniModel->findAll();
---
SELECT *
FROM `tb_kelompok_tani`