app/Controllers/TransaksiTanamController.php

    public function index()
    {
        $data = [
            'title' => 'Transaksi Tanam',
            'transaksi_tanam' => $this->transaksiTanamModel->select('tb_transaksi_tanam.*, tb_lahan.luas, tb_lahan.lokasi, tb_kecamatan.nama_kecamatan, tb_bulan.month_name')->join('tb_lahan', 'tb_lahan.id_lahan = tb_transaksi_tanam.id_lahan', 'left')->join('tb_petani', 'tb_petani.id_petani = tb_lahan.id_petani', 'left')->join('tb_kelompok_tani', 'tb_kelompok_tani.id_kelompok_tani = tb_petani.id_kelompok_tani', 'left')->join('tb_kecamatan', 'tb_kecamatan.id_kecamatan = tb_kelompok_tani.id_kecamatan', 'left')->join('tb_bulan', 'tb_bulan.id_month = tb_transaksi_tanam.bulan', 'left')->findAll(),
---
SELECT `tb_transaksi_tanam`.*, `tb_lahan`.`luas`, `tb_lahan`.`lokasi`, `tb_kecamatan`.`nama_kecamatan`, `tb_bulan`.`month_name`
FROM `tb_transaksi_tanam`
LEFT JOIN `tb_lahan` ON `tb_lahan`.`id_lahan` = `tb_transaksi_tanam`.`id_lahan`
LEFT JOIN `tb_petani` ON `tb_petani`.`id_petani` = `tb_lahan`.`id_petani`
LEFT JOIN `tb_kelompok_tani` ON `tb_kelompok_tani`.`id_kelompok_tani` = `tb_petani`.`id_kelompok_tani`
LEFT JOIN `tb_kecamatan` ON `tb_kecamatan`.`id_kecamatan` = `tb_kelompok_tani`.`id_kecamatan`
LEFT JOIN `tb_bulan` ON `tb_bulan`.`id_month` = `tb_transaksi_tanam`.`bulan`

    public function update($id)
    {
        $data = [
            'bulan' => $this->request->getPost('bulan'),
            'tahun' => $this->request->getPost('tahun'),
            'total_area' => $this->request->getPost('total_area'),
            'urea' => $this->request->getPost('urea'),
            'id_lahan' => $this->request->getPost('id_lahan'),
        ];

        $this->transaksiTanamModel->update($id, $data);
---
UPDATE `tb_transaksi_tanam` SET `bulan` = '4', `tahun` = '2025', `total_area` = '195', `urea` = '65', `id_lahan` = '7', `updated_at` = '2025-04-17 14:08:28'
WHERE `tb_transaksi_tanam`.`id_transaksi_tanam` IN ('12')