app/Models/KecamatanModel.php

    public function getDataForLandingPage()
    {
        $query = $this->db->table($this->table);
        $query->select('id_kecamatan, nama_kecamatan');

        $result = $query->get()->getResultArray();
---
SELECT `id_kecamatan`, `nama_kecamatan`
FROM `tb_kecamatan`