app/Models/LahanModel.php

    public function getDataForLandingPage($keyword, $id_komoditas)
    {
        $query = $this->db->table($this->table);
        $query->select('tb_lahan.id_lahan, tb_petani.nama_lengkap, tb_petani.nik, tb_petani.handphone, tb_lahan.jenis, tb_lahan.status_kepemilikan, tb_lahan.total_penghasilan, tb_lahan.lokasi, tb_lahan.luas, tb_komoditas.nama_komoditas, tb_jenis_kepemilikan.nama_jenis_kepemilikan');
        $query->join('tb_petani', 'tb_petani.id_petani = tb_lahan.id_petani', 'left');
        $query->join('tb_komoditas', 'tb_komoditas.id_komoditas = tb_lahan.jenis', 'left');
        $query->join('tb_jenis_kepemilikan', 'tb_jenis_kepemilikan.id_jenis_kepemilikan = tb_lahan.status_kepemilikan', 'left');

        if ($keyword != "all") {
            $query->like('tb_petani.nama_lengkap', $keyword);
        }

        if ($id_komoditas != '0') {
            $query->where('tb_lahan.jenis', $id_komoditas);
        }

        $result = $query->get()->getResultArray();
---
SELECT `tb_lahan`.`id_lahan`, `tb_petani`.`nama_lengkap`, `tb_petani`.`nik`, `tb_petani`.`handphone`, `tb_lahan`.`jenis`, `tb_lahan`.`status_kepemilikan`, `tb_lahan`.`total_penghasilan`, `tb_lahan`.`lokasi`, `tb_lahan`.`luas`, `tb_komoditas`.`nama_komoditas`, `tb_jenis_kepemilikan`.`nama_jenis_kepemilikan`
FROM `tb_lahan`
LEFT JOIN `tb_petani` ON `tb_petani`.`id_petani` = `tb_lahan`.`id_petani`
LEFT JOIN `tb_komoditas` ON `tb_komoditas`.`id_komoditas` = `tb_lahan`.`jenis`
LEFT JOIN `tb_jenis_kepemilikan` ON `tb_jenis_kepemilikan`.`id_jenis_kepemilikan` = `tb_lahan`.`status_kepemilikan`
WHERE `tb_petani`.`nama_lengkap` LIKE '%%' ESCAPE '!'